{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "hi",
        "how are you",
        "hello",
        "hey",
        "good day",
        "whats up",
        "good morning",
        "good afternoon",
        "good evening",
        "hey there",
        "what's going on",
        "how's it going",
        "nice to meet you",
        "howdy",
        "yo"
      ],
      "responses": [
        "Hello! How can I help you today?",
        "Hi there, how can I help you?",
        "Greetings! What can I do for you?",
        "Hey! How may I assist you?",
        "Hello, nice to meet you! How can I assist you today?"
      ],
      "context_set": ""
    },
    {
      "tag": "name",
      "patterns": [
        "what is your name?",
        "name",
        "who are you?",
        "what should i call you?"
      ],
      "responses": [
        "My name is MARC.",
        "You can call me MARC!",
        "I am MARC. Nice to meet you!"
      ],
      "context_set": ""
    },
    {
      "tag": "goodbye",
      "patterns": [
        "bye",
        "goodbye",
        "i'm going",
        "i have to go",
        "see you",
        "goodnight",
        "farewell",
        "take care",
        "until next time",
        "see you later",
        "gotta go",
        "bye-bye"
      ],
      "responses": [
        "Goodbye!",
        "Bye! It was nice speaking with you.",
        "Farewell! Take care.",
        "Until next time! Have a great day.",
        "See you later! Don't hesitate to come back if you have more questions.",
        "Goodnight! Sleep well.",
        "Bye-bye! Take care and have a wonderful day."
      ],
      "context_set": ""
    },
    {
      "tag": "services",
      "patterns": [
        "what do you do?",
        "service",
        "what do you offer?",
        "what can you help me with?"
      ],
      "responses": [
        "I offer two services for tutoring mathematics: Revision Mode and Assessment Mode. During revision mode, I can help you understand math topics. During assessment mode, I can test your knowledge and give you feedback to identify your strengths and weaknesses.",
        "I can help you understand mathematics. I offer a revision mode and an assessment mode.",
        "I have two modes: revision and assessment mode. I can help you revise a topic such as arithmetics, triangles, rectangles, and circles. I can also test your knowledge and give you feedback to identify your strengths and weaknesses."
      ],
      "context_set": ""
    },
    {
      "tag": "revision-mode",
      "patterns": [
        "revise",
        "revision",
        "lets revise",
        "revision mode",
        "I would like to revise",
        "help me with revision"
      ],
      "responses": [
        "Okay! Lets begin our revision session. What topic would you like to revise?",
        "Great! I will help you revise. What would you specifically like to revise?",
        "What would you specifically like to revise?",
        "Absolutely! I'm here to help you with your revision. Which subject or concept would you like to focus on?",
        "Fantastic! Let's dive into your revision. Could you please let me know the specific area or topic you'd like to cover?",
        "That's wonderful! I'm ready to assist you with your revision. What particular aspect or subject do you want to go over?",
        "Perfect! I'm here to support your revision efforts. Is there a particular chapter or subject you'd like to concentrate on?",
        "Excellent choice! Let's get started with your revision. Which specific topic or chapter do you want to review?",
        "Terrific! I'm here to guide you through your revision. Please let me know the subject or concept you'd like to focus on.",
        "Wonderful! Revision is a great way to solidify your understanding. Which particular area or topic do you want to revise?",
        "Great initiative! Let's make your revision session productive. Could you please mention the specific topic or subject you'd like to go through?"
      ],
      "context_set": ""
    },
    {
      "tag": "assessment-mode",
      "patterns": [
        "assessment",
        "assessment mode",
        "i would like to test my knowledge",
        "i would like to test my maths skills",
        "test my knowledge",
        "assess my skills",
        "take an assessment",
        "challenge me",
        "quiz me",
        "check my understanding",
        "test my understanding",
        "evaluate my learning",
        "maths assessment",
        "maths quiz"
      ],
      "responses": [
        "Okay! Lets begin our assessment. Here is how it's going to work. I'm going to give you a set of questions, try your best to answer all questions. If you can't answer a question you can go on to the next one.",
        "Great! Here's the plan: I'll provide you with a set of questions, and your goal is to answer as many as you can. If you come across a challenging question, you can always move on to the next one.",
        "Perfect! Let's kick off the assessment. Here is how it's going to work. I'll ask you a set of questions, and you'll attempt to answer them all. If you get stuck on a question, don't worry, just proceed to the next one.",
        "Excellent! The assessment begins now. Here's the rundown: I'll be giving you a series of questions to tackle. Answer to the best of your ability, and if you encounter any difficulty, simply proceed to the next question.",
        "Wonderful! It's time to put your knowledge to the test. Here's what we'll do: I'll ask you a range of questions, and your objective is to answer as many as possible. Don't fret if you get stuck; you can always move on to the next question."
      ],
      "context_set": ""
    },
    {
      "tag": "gratitude",
      "patterns": [
        "thank you",
        "thanks",
        "thanks for the help",
        "i appreciate the help",
        "thank for the support",
        "i am grateful for your service",
        "i am grateful"
      ],
      "responses": [
        "You're welcome!",
        "You're most welcome!",
        "No problem at all! Happy to help.",
        "It's my pleasure to assist you!",
        "Not a problem! I'm here to support you.",
        "You're absolutely welcome! I'm glad I could be of help.",
        "You're very welcome! If you have any more questions, feel free to ask.",
        "Don't mention it! I'm always here to lend a hand.",
        "Anytime! I'm here 24/7 to assist you.",
        "You're welcome! If there's anything else you need assistance with, just let me know.",
        "You're welcome! Remember, I'm here to help you anytime you need it.",
        "It's my pleasure to be of service! Let me know if there's anything else I can do for you.",
        "No worries! Helping you is what I'm here for.",
        "You're welcome! I'm delighted I could be of assistance to you.",
        "It's no trouble at all! Helping you is my priority.",
        "You're welcome! I'm grateful to be able to support you in your needs."
      ],
      "context_set": ""
    },
    {
      "tag": "apologies",
      "patterns": [
        "thats wrong",
        "looks like that is wrong",
        "apologies",
        "thats not nice to say",
        "thats inappropriate",
        "that is not right"
      ],
      "responses": [
        "I'm sorry for the inconvenience.",
        "I apologize for any inconvenience caused.",
        "Sorry about that.",
        "Apologies for the confusion.",
        "I'm sorry if I misunderstood.",
        "I apologize if I made a mistake.",
        "Sorry, I'll try to do better next time."
      ],
      "context_set": ""
    },
    {
      "tag": "jokes",
      "patterns": [
        "joke",
        "can you tell me a joke",
        "give me a joke",
        "say something funny",
        "funny",
        "what is a joke"
      ],
      "responses": [
        "Why don't scientists trust atoms? Because they make up everything!",
        "Why did the bicycle fall over? Because it was two-tired!",
        "What do you call a fish with no eyes? Fsh!",
        "Why did the scarecrow win an award? Because he was outstanding in his field!",
        "What do you call fake spaghetti? An impasta!",
        "Why did the tomato turn red? Because it saw the salad dressing!",
        "What's the best time to go to the dentist? Tooth-hurty!"
      ],
      "context_set": ""
    },
    {
      "tag": "arithmetic",
      "patterns": [
        "arithmetic",
        "i need help with arithmetic",
        "i am struggling with arithmetics",
        "i need help adding",
        "i need help subtracting",
        "i need help with multiplications",
        "i need help with division",
        "how do you add",
        "how do you subtract",
        "how do you multiply",
        "how do you divide",
        "addition",
        "add",
        "subtract",
        "subtraction",
        "multiplication",
        "multiply",
        "division",
        "divide"
      ],
      "responses": [
        "I can help you with arithmetics. Let's work through a question together.",
        "Let's get started revising arithmetics. We can work through a question together.",
        "Great. Let's begin by looking at some arithmetic problems."
      ],
      "context_set": ""
    },
    {
      "tag": "solve",
      "patterns": [
        "how do i solve",
        "how do i solve this question",
        "how do i calculate this question",
        "what is the answer to this question",
        "what is the solution to this question",
        "what is the solution to this problem",
        "solve this",
        "find the answer to",
        "calculate"
      ],
      "responses": [""],
      "context_set": ""
    },
    {
      "tag": "trigonometry",
      "patterns": [
        "trigonometry",
        "i need help with trigonometry",
        "i am struggling with trigonometry",
        "i need help triangles",
        "i need help triangle",
        "i need help with right angle triangles",
        "i need help with isosceles triangle",
        "i need help with scalene triangle",
        "triangle",
        "triangles"
      ],
      "responses": [
        "I can help you with trigonometry. Let's work through a question together.",
        "Let's get started revising trigonometry. We can work through a question together.",
        "Great. Let's begin by looking at some trigonometry problems."
      ],
      "context_set": ""
    },
    {
      "tag": "rectangle",
      "patterns": [
        "rectangles",
        "i need help with rectangles",
        "i am struggling with rectangles",
        "i need help rectangles",
        "i need help rectangle",
        "i need help with rectangles",
        "i need help with rectangle",
        "how do you calculate area of rectangle",
        "how do you calculate area of this rectangles",
        "rectangle"
      ],
      "responses": [
        "I can help you with rectangles. Let's work through a question together.",
        "Let's get started revising rectangles. We can work through a question together.",
        "Great. Let's begin by looking at some rectangles problems."
      ],
      "context_set": ""
    },
    {
      "tag": "circle",
      "patterns": [
        "circles",
        "i need help with circles",
        "i am struggling with circles",
        "i need help circles",
        "i need help rectangle",
        "i need help with circles",
        "i need help with circle",
        "how do you calculate area of circle",
        "how do you calculate area of this circles",
        "circle"
      ],
      "responses": [
        "I can help you with circles. Let's work through a question together.",
        "Let's get started revising circles. We can work through a question together.",
        "Great. Let's begin by looking at some circles problems."
      ],
      "context_set": ""
    },
    {
      "tag": "triangle-area",
      "patterns": [
        "find the area of a triangle with side lengths",
        "how do i find the area of a triangle",
        "how do i find the area of a triangle with side lengths",
        "what is the area of a triangle with lengths",
        "area of triangle with side lengths",
        "how do you calculate area of triangle",
        "how do you calculate area of triangle with side lengths",
        "how do you calculate area of triangle with lengths"
      ],
      "responses": [""],
      "context_set": ""
    },
    {
      "tag": "rectangle-area",
      "patterns": [
        "find the area of a rectangle with side lengths",
        "how do i find the area of a rectangle",
        "how do i find the area of a rectangle with side lengths",
        "what is the area of a rectangle with lengths",
        "area of rectangle with side lengths",
        "how do you calculate area of rectangle",
        "how do you calculate area of rectangle with side lengths",
        "how do you calculate area of rectangle with lengths"
      ],
      "responses": [""],
      "context_set": ""
    },
    {
      "tag": "circle-area",
      "patterns": [
        "find the area of a circle with radius",
        "how do i find the area of a circle",
        "how do i find the area of a circle with radius",
        "what is the area of a circle with radius",
        "area of circle with radius",
        "how do you calculate area of circle",
        "how do you calculate area of circle with radius"
      ],
      "responses": [""],
      "context_set": ""
    },
    {
      "tag": "circle-circumference",
      "patterns": [
        "find the circumference of a circle with radius",
        "how do i find the circumference of a circle",
        "how do i find the circumference of a circle with radius",
        "what is the circumference of a circle with radius",
        "area of circumference with radius",
        "how do you calculate circumference of circle",
        "how do you calculate circumference of circle with radius"
      ],
      "responses": [""],
      "context_set": ""
    },
    {
      "tag": "answer",
      "patterns": [
        "i think the answer is",
        "the answer is",
        "i believe the answer is",
        "answer"
      ],
      "responses": [""],
      "context_set": ""
    },
    {
      "tag": "solution",
      "patterns": [
        "i am struggling",
        "i am completely lost",
        "i do not know how to solve this.",
        "whats the solution?",
        "solution",
        "struggling",
        "i'm struggling, can you provide the solution?",
        "i'm completely lost, what's the solution?",
        "i don't know how to solve this, can you give me the solution?",
        "what's the solution to this problem?",
        "i'm really struggling here, i need the solution.",
        "can you help me with the solution, please?",
        "i've hit a wall, what's the solution?",
        "i can't figure it out, can you provide the solution?",
        "i'm at a loss, what's the solution to this question?"
      ],
      "responses": [""],
      "context_set": ""
    },
    {
      "tag": "hint",
      "patterns": [
        "i need help",
        "help",
        "i need a hint",
        "hint",
        "can i get a hint?",
        "i am not sure but i need a hint",
        "can you give me a hint?",
        "i'm stuck, can you provide a hint?",
        "i could use some assistance, any hints?",
        "i'm having trouble, do you have any hints?",
        "i'm not sure how to proceed, can you give me a hint?",
        "i need some guidance, can you offer a hint?",
        "could you point me in the right direction with a hint?",
        "i'm finding it difficult, a hint would be appreciated.",
        "i've hit a roadblock, can I get a hint?"
      ],
      "responses": [""],
      "context_set": ""
    }
  ]
}
