[
  {
    "type": "additive",
    "category": "arithmetic",
    "text": "John, Joe, Sarah are in the park playing football and enjoying the sunny weather. They stop to have some lunch. John has 3 apples in his lunchbox. Joe has 2 apples in his lunchbox. Joe is feeling generous and gives 2 apples to John. Sarah also has 9 apples in her lunchbox. John is full and gives 4 apples to Sarah. How many apples does John now have?"
  },
  {
    "type": "additive",
    "category": "arithmetic",
    "text": "John, Joe, Sarah are hungry and decide they want to go eat some lunch. They go to their favorite restaurant nearby and decide to order pizza. John takes 2 slices of pizza. Joe loves pizza and decides to take 4 slices of pizza. Sarah then takes the final 2 pizzas. Joe is feeling generous and gives 1 pizza to John. Sarah is also feeling generous and gives 1 pizza to John. How many pizzas did John eat?"
  },
  {
    "type": "addition",
    "category": "arithmetic",
    "text": "John has 5 apples and his friend gave him 3 more. How many apples does John have now?"
  },
  {
    "type": "addition",
    "category": "arithmetic",
    "text": "A library currently has 10 books. The librarian orders 20 more books. How many books does the library have?"
  },
  {
    "type": "subtraction",
    "category": "arithmetic",
    "text": "There are 25 birds that are currently sitting on a tree. It starts to rain and 10 of them fly away. How many birds are there left on the tree?"
  },
  {
    "type": "subtraction",
    "category": "arithmetic",
    "text": "A boy has 8 marbles. The boy gives 3 marbles away. How many marbles does the boy have now?"
  },
  {
    "type": "multiplication",
    "category": "arithmetic",
    "text": "John has 5 boxes of chocolates, each box contains 10 chocolates. How many chocolates does John have in total?"
  },
  {
    "type": "multiplication",
    "category": "arithmetic",
    "text": "A school has 4 classes, each class has 25 students. How many students are there in total at the school?"
  },
  {
    "type": "division",
    "category": "arithmetic",
    "text": "There are 24 cookies to share equally among 6 children. How many cookies will each child get?"
  },
  {
    "type": "division",
    "category": "arithmetic",
    "text": "A teacher has 36 pencils to share equally among 9 students. How many pencils will each student get?"
  }
]
