[
  {
    "tag": "uncertain-responses",
    "responses": [
      "Sorry, I did not understand the question!",
      "I am unable to answer that question.",
      "I didn't quite catch that. Please try again!",
      "I'm afraid I don't quite understand what you're asking.",
      "I'm sorry, I'm having trouble understanding the question.",
      "Apologies, but I didn't grasp the question you asked.",
      "I'm afraid I don't quite understand what you're asking."
    ]
  },
  {
    "tag": "correct-responses",
    "responses": [
      "Excellent job, that is indeed the correct answer!",
      "You've nailed it, that's the right solution!",
      "Well done, your response is spot-on!",
      "Great work, that is the correct solution!",
      "Fantastic, you've got it exactly right!"
    ]
  },
  {
    "tag": "incorrect-responses",
    "responses": [
      "I appreciate your effort, but that is not the correct answer.",
      "Hmm, let's try again. The answer you provided is not quite right.",
      "It looks like there may have been a mistake in your response. Let's give it another shot.",
      "Don't worry, everyone makes mistakes. The answer you gave is not correct, but let's work together to find the right one.",
      "I understand it can be challenging, but the answer you provided is not accurate. Let's keep trying, you're doing great!",
      "I can see you put in some thought, but unfortunately, that's not the right answer. Don't worry, we'll work through it together.",
      "Oops! That answer didn't quite hit the mark, but don't fret, we'll figure it out.",
      "Hmm, that's not the correct response, but no need to worry. Let's analyze the problem again and find the right solution.",
      "I appreciate your participation, but that answer isn't accurate. Let's keep exploring different possibilities together.",
      "Not quite there, but don't give up! We'll continue to work together until we arrive at the correct answer."
    ]
  },
  {
    "tag": "praise",
    "responses": [
      "Excellent work! You have really grasped the concept and applied it perfectly.",
      "Fantastic job! Your understanding of the topic is impressive.",
      "You're doing incredibly well! Your dedication and effort are paying off.",
      "Wonderful job! Your answers are accurate and well-thought-out.",
      "Superb work! I'm impressed by your ability to solve complex problems with ease.",
      "Marvelous effort! You're demonstrating a deep understanding of the subject matter.",
      "Great job! You're making remarkable progress and should be proud of your achievements.",
      "Outstanding work! Your attention to detail and critical thinking skills are commendable.",
      "Bravo! Your performance is consistently outstanding.",
      "Well done! Your enthusiasm and eagerness to learn are truly inspiring."
    ]
  },
  {
    "tag": "feedback",
    "responses": [
      "Overall, I am impressed with your efforts, but I noticed a few small mistakes that need some correction.",
      "I appreciate your effort, but there are a few areas that could use improvement.",
      "Good job overall, but let's take a closer look at some areas to help you improve your understanding.",
      "I appreciate your hard work, but there are a couple of errors that need to be addressed.",
      "Your attempt is on the right track, but there are a few misunderstandings that we should clarify."
    ]
  }
]
