[
  {
    "tag": "greeting",
    "responses": [
      "Hello! How can I help you today?",
      "Hi there, how can I help you?",
      "Greetings! What can I do for you?",
      "Hey! How may I assist you?",
      "Hello, nice to meet you! How can I assist you today?"
    ]
  },
  {
    "tag": "name",
    "responses": [
      "My name is MARC.",
      "You can call me MARC!",
      "I am MARC. Nice to meet you!"
    ]
  },
  {
    "tag": "goodbye",
    "responses": [
      "Goodbye!",
      "Bye! It was nice speaking with you.",
      "Farewell! Take care.",
      "Until next time! Have a great day.",
      "See you later! Don't hesitate to come back if you have more questions.",
      "Bye-bye! Take care and have a wonderful day."
    ]
  },
  {
    "tag": "services",
    "responses": [
      "I offer two services for tutoring mathematics: Revision Mode and Assessment Mode. During revision mode, I can help you understand math topics. During assessment mode, I can test your knowledge and give you feedback to identify your strengths and weaknesses.",
      "I can help you understand mathematics. I offer a revision mode and an assessment mode.",
      "I have two modes: revision and assessment mode. I can help you revise a topic such as arithmetics, triangles, rectangles, and circles. I can also test your knowledge and give you feedback to identify your strengths and weaknesses."
    ]
  },
  {
    "tag": "gratitude",
    "responses": [
      "You're welcome!",
      "You're most welcome!",
      "No problem at all! Happy to help.",
      "It's my pleasure to assist you!",
      "Not a problem! I'm here to support you.",
      "You're absolutely welcome! I'm glad I could be of help.",
      "You're very welcome! If you have any more questions, feel free to ask.",
      "Don't mention it! I'm always here to lend a hand.",
      "Anytime! I'm here 24/7 to assist you.",
      "You're welcome! If there's anything else you need assistance with, just let me know.",
      "You're welcome! Remember, I'm here to help you anytime you need it.",
      "It's my pleasure to be of service! Let me know if there's anything else I can do for you.",
      "No worries! Helping you is what I'm here for.",
      "You're welcome! I'm delighted I could be of assistance to you.",
      "It's no trouble at all! Helping you is my priority.",
      "You're welcome! I'm grateful to be able to support you in your needs."
    ]
  },
  {
    "tag": "jokes",
    "responses": [
      "Why don't scientists trust atoms? Because they make up everything!",
      "Why did the bicycle fall over? Because it was two-tired!",
      "What do you call a fish with no eyes? Fsh!",
      "Why did the scarecrow win an award? Because he was outstanding in his field!",
      "What do you call fake spaghetti? An impasta!",
      "Why did the tomato turn red? Because it saw the salad dressing!",
      "What's the best time to go to the dentist? Tooth-hurty!"
    ]
  },
  {
    "tag": "apologies",
    "responses": [
      "I'm sorry for the inconvenience.",
      "I apologize for any inconvenience caused.",
      "Sorry about that.",
      "Apologies for the confusion.",
      "I'm sorry if I misunderstood.",
      "I apologize if I made a mistake.",
      "Sorry, I'll try to do better next time."
    ]
  },
  {
    "tag": "revision-mode",
    "responses": [
      "Okay! Lets begin our revision session. What topic would you like to revise?",
      "Great! I will help you revise. What would you specifically like to revise?",
      "What would you specifically like to revise?",
      "Absolutely! I'm here to help you with your revision. Which subject or concept would you like to focus on?",
      "Fantastic! Let's dive into your revision. Could you please let me know the specific area or topic you'd like to cover?",
      "That's wonderful! I'm ready to assist you with your revision. What particular aspect or subject do you want to go over?",
      "Perfect! I'm here to support your revision efforts. Is there a particular chapter or subject you'd like to concentrate on?",
      "Excellent choice! Let's get started with your revision. Which specific topic or chapter do you want to review?",
      "Terrific! I'm here to guide you through your revision. Please let me know the subject or concept you'd like to focus on.",
      "Wonderful! Revision is a great way to solidify your understanding. Which particular area or topic do you want to revise?",
      "Great initiative! Let's make your revision session productive. Could you please mention the specific topic or subject you'd like to go through?"
    ]
  },
  {
    "tag": "assessment-mode",
    "responses": [
      "Okay! Lets begin our assessment. Here is how it's going to work. I'm going to give you a set of questions, try your best to answer all questions. If you can't answer a question you can go on to the next one.",
      "Great! Here's the plan: I'll provide you with a set of questions, and your goal is to answer as many as you can. If you come across a challenging question, you can always move on to the next one.",
      "Perfect! Let's kick off the assessment. Here is how it's going to work. I'll ask you a set of questions, and you'll attempt to answer them all. If you get stuck on a question, don't worry, just proceed to the next one.",
      "Excellent! The assessment begins now. Here's the rundown: I'll be giving you a series of questions to tackle. Answer to the best of your ability, and if you encounter any difficulty, simply proceed to the next question.",
      "Wonderful! It's time to put your knowledge to the test. Here's what we'll do: I'll ask you a range of questions, and your objective is to answer as many as possible. Don't fret if you get stuck; you can always move on to the next question."
    ]
  },
  {
    "tag": "uncertain-responses",
    "responses": [
      "Sorry, I did not understand the question!",
      "I am unable to answer that question.",
      "I didn't quite catch that. Please try again!",
      "I'm afraid I don't quite understand what you're asking.",
      "I'm sorry, I'm having trouble understanding the question.",
      "Apologies, but I didn't grasp the question you asked.",
      "I'm afraid I don't quite understand what you're asking."
    ]
  },
  {
    "tag": "correct-responses",
    "responses": [
      "Excellent job, that is indeed the correct answer!",
      "You've nailed it, that's the right solution!",
      "Well done, your response is spot-on!",
      "Great work, that is the correct solution!",
      "Fantastic, you've got it exactly right!"
    ]
  },
  {
    "tag": "incorrect-responses",
    "responses": [
      "I appreciate your effort, but that is not the correct answer.",
      "Hmm, let's try again. The answer you provided is not quite right.",
      "It looks like there may have been a mistake in your response. Let's give it another shot.",
      "Don't worry, everyone makes mistakes. The answer you gave is not correct, but let's work together to find the right one.",
      "I understand it can be challenging, but the answer you provided is not accurate. Let's keep trying, you're doing great!",
      "I can see you put in some thought, but unfortunately, that's not the right answer. Don't worry, we'll work through it together.",
      "Oops! That answer didn't quite hit the mark, but don't fret, we'll figure it out.",
      "Hmm, that's not the correct response, but no need to worry. Let's analyze the problem again and find the right solution.",
      "I appreciate your participation, but that answer isn't accurate. Let's keep exploring different possibilities together.",
      "Not quite there, but don't give up! We'll continue to work together until we arrive at the correct answer."
    ]
  },
  {
    "tag": "praise",
    "responses": [
      "Excellent work! You have really grasped the concept and applied it perfectly.",
      "Fantastic job! Your understanding of the topic is impressive.",
      "You're doing incredibly well! Your dedication and effort are paying off.",
      "Wonderful job! Your answers are accurate and well-thought-out.",
      "Superb work! I'm impressed by your ability to solve complex problems with ease.",
      "Marvelous effort! You're demonstrating a deep understanding of the subject matter.",
      "Great job! You're making remarkable progress and should be proud of your achievements.",
      "Outstanding work! Your attention to detail and critical thinking skills are commendable.",
      "Bravo! Your performance is consistently outstanding.",
      "Well done! Your enthusiasm and eagerness to learn are truly inspiring."
    ]
  },
  {
    "tag": "feedback",
    "responses": [
      "Overall, I am impressed with your efforts, but I noticed a few small mistakes that need some correction.",
      "I appreciate your effort, but there are a few areas that could use improvement.",
      "Good job overall, but let's take a closer look at some areas to help you improve your understanding.",
      "I appreciate your hard work, but there are a couple of errors that need to be addressed.",
      "Your attempt is on the right track, but there are a few misunderstandings that we should clarify."
    ]
  }
]
